МояРазработка.Аратюнов/src/Catalogs/УО_НаборыДанных/УО_НаборыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УО_НаборыДанных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.УО_РегистрацияСхемы</owners>
  <attributes>
    <name>ВидНабора</name>
    <type>
      <types>EnumRef.УО_ВидыНаборовДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

МояРазработка.Аратюнов/src/InformationRegisters/УО_Индексы/УО_Индексы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УО_Индексы</name>
  <resources>
    <name>Набор</name>
    <type>
      <types>CatalogRef.УО_НаборыДанных</types>
    </type>
  </resources>
  <dimensions>
    <name>Схема</name>
    <type>
      <types>CatalogRef.УО_РегистрацияСхемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.УО_НаборыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МояРазработка.Аратюнов/src/Catalogs/УО_НаборыДанных/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СдвинутьНаборДанных(Команда)

	//ПоказатьОповещениеПользователя(Команда.Имя);
	СдвинутьНабор(ТекущийЭлемент.ТекущаяСтрока, ?(Команда.Имя = "ПереместитьВниз", -1,1));
	ТекущийЭлемент.Обновить();
	СписокПриАктивизацииСтроки(ТекущийЭлемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СдвинутьНабор(Знач Набор, Знач Шаг)

	РегистрыСведений.УО_Индексы.Сдвинуть(Набор, Шаг);	

КонецПроцедуры // СдвинутьНабор()


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Не Элементы.ФормаСоздать.Доступность;

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	Элементы.ФормаСоздать.Доступность = 
		ДанныеСтроки = Неопределено
		ИЛИ Строка(ДанныеСтроки.ВидНабора) = "Объединение";
	
	Элементы.СписокКонтекстноеМенюСоздать.Доступность = Элементы.ФормаСоздать.Доступность; 
	Элементы.СписокКонтекстноеМенюПеремещение.Доступность = 
			ДанныеСтроки <> Неопределено
			И ДанныеСтроки.Записей > 1;
			
	Если Элементы.СписокКонтекстноеМенюПеремещение.Доступность Тогда
		ОпределитьДоступностьПодПунктов( Элемент.ТекущаяСтрока,
							Элементы.СписокКонтекстноеМенюПереместитьВверх.Доступность,	
							Элементы.СписокКонтекстноеМенюПереместитьВниз.Доступность);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Выбрана пустая область списка
	Если Строка = Неопределено Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	// Выбран корневой уровень списка
	Если Строка.Пустая() Тогда
		Возврат;	
	КонецЕсли;
	
	// Выбран набор данных получателя не Объединение
	ДанныеСтрокиПолучателя = Элемент.ДанныеСтроки(Строка);
	Если Строка(ДанныеСтрокиПолучателя.ВидНабора) <> "Объединение" Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;		
	КонецЕсли;
	
	// Выбран набор данных объединение вложенный в перетаскиваемый
	Если НаборПолучателяПодчиненТекущему(Элемент.ТекущаяСтрока, Строка) Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаборПолучателяПодчиненТекущему(Знач ТекущийНабор, Знач НаборПолучателя)
	Возврат Справочники.УО_НаборыДанных.ЯвляетсяПодчиненным(ТекущийНабор, НаборПолучателя);		
КонецФункции

&НаСервереБезКонтекста
Процедура ОпределитьДоступностьПодПунктов(Знач НаборДанных, ДоступностьВверх, ДоступностьВниз)

	РегистрыСведений.УО_Индексы.ПроверитьСоседниеНаборы(НаборДанных, ДоступностьВверх, ДоступностьВниз);
//	ДоступностьВверх = Справочники.УО_НаборыДанных.ПредыдущийНабор(НаборДанных) <> Неопределено;
//	ДоступностьВниз = Справочники.УО_НаборыДанных.СледующийНабор(НаборДанных) <> Неопределено;

КонецПроцедуры
